<a href="https://colab.research.google.com/github/poojakanchala/Edukroncodes7781/blob/main/Pandas_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Pandas Data Analysis - 500 Questions

Basic Level (Questions 1-150)

Part1 - Descriptive & Basic Queries

In [2]:
import pandas as pd
Data = pd.read_excel("/content/Sample - Superstore.xls")
df= pd.DataFrame(Data)
df

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2016-152156,2016-11-08,2016-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.9600,2,0.00,41.9136
1,2,CA-2016-152156,2016-11-08,2016-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.9400,3,0.00,219.5820
2,3,CA-2016-138688,2016-06-12,2016-06-16,Second Class,DV-13045,Darrin Van Huff,Corporate,United States,Los Angeles,...,90036,West,OFF-LA-10000240,Office Supplies,Labels,Self-Adhesive Address Labels for Typewriters b...,14.6200,2,0.00,6.8714
3,4,US-2015-108966,2015-10-11,2015-10-18,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,...,33311,South,FUR-TA-10000577,Furniture,Tables,Bretford CR4500 Series Slim Rectangular Table,957.5775,5,0.45,-383.0310
4,5,US-2015-108966,2015-10-11,2015-10-18,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,...,33311,South,OFF-ST-10000760,Office Supplies,Storage,Eldon Fold 'N Roll Cart System,22.3680,2,0.20,2.5164
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9989,9990,CA-2014-110422,2014-01-21,2014-01-23,Second Class,TB-21400,Tom Boeckenhauer,Consumer,United States,Miami,...,33180,South,FUR-FU-10001889,Furniture,Furnishings,Ultra Door Pull Handle,25.2480,3,0.20,4.1028
9990,9991,CA-2017-121258,2017-02-26,2017-03-03,Standard Class,DB-13060,Dave Brooks,Consumer,United States,Costa Mesa,...,92627,West,FUR-FU-10000747,Furniture,Furnishings,Tenex B1-RE Series Chair Mats for Low Pile Car...,91.9600,2,0.00,15.6332
9991,9992,CA-2017-121258,2017-02-26,2017-03-03,Standard Class,DB-13060,Dave Brooks,Consumer,United States,Costa Mesa,...,92627,West,TEC-PH-10003645,Technology,Phones,Aastra 57i VoIP phone,258.5760,2,0.20,19.3932
9992,9993,CA-2017-121258,2017-02-26,2017-03-03,Standard Class,DB-13060,Dave Brooks,Consumer,United States,Costa Mesa,...,92627,West,OFF-PA-10004041,Office Supplies,Paper,"It's Hot Message Books with Stickers, 2 3/4"" x 5""",29.6000,4,0.00,13.3200
9993,9994,CA-2017-119914,2017-05-04,2017-05-09,Second Class,CC-12220,Chris Cortes,Consumer,United States,Westminster,...,92683,West,OFF-AP-10002684,Office Supplies,Appliances,"Acco 7-Outlet Masterpiece Power Center, Wihtou...",243.1600,2,0.00,72.9480

In [27]:
# Question 1: Find total number of orders in the dataset.
# df["Order ID"].nunique()           ######for unique number of orders
df.shape[0]

9994

In [29]:
# Question 2: Find the earliest order date.
df["Order Date"].min()

Timestamp('2014-01-03 00:00:00')

In [30]:
# Question 3: Find the latest order date.
df["Order Date"].max()

Timestamp('2017-12-30 00:00:00')

In [37]:
# Question 4: Find the total number of unique customers.
df['Customer ID'].nunique()

793

In [39]:
# Question 5: Find the total number of unique products sold.
df['Product ID'].nunique()

1862

In [43]:
# Question 6: Find the total number of unique categories.
df["Category"].nunique()

3

In [45]:
# Question 7: Find the total number of unique sub-categories.
df["Sub-Category"].nunique()

17

In [50]:
# Question 8: Count number of orders in each region.
df.groupby('Region')['Order ID'].nunique()

Region
Central    1175
East       1401
South       822
West       1611
Name: Order ID, dtype: int64

In [51]:
# Question 9: Count number of orders by state.
df.groupby('State')['Order ID'].nunique()

State
Alabama                   34
Arizona                  108
Arkansas                  27
California              1021
Colorado                  79
Connecticut               45
Delaware                  44
District of Columbia       4
Florida                  200
Georgia                   91
Idaho                     11
Illinois                 276
Indiana                   73
Iowa                      17
Kansas                    14
Kentucky                  61
Louisiana                 21
Maine                      3
Maryland                  46
Massachusetts             62
Michigan                 117
Minnesota                 44
Mississippi               26
Missouri                  30
Montana                    8
Nebraska                  23
Nevada                    23
New Hampshire             17
New Jersey                61
New Mexico                22
New York                 562
North Carolina           136
North Dakota               2
Ohio                     236
Oklahoma                  34
Oregon                    56
Pennsylvania             288
Rhode Island              25
South Carolina            20
South Dakota               5
Tennessee                 91
Texas                    487
Utah                      26
Vermont                    6
Virginia                 115
Washington               256
West Virginia              2
Wisconsin                 53
Wyoming                    1
Name: Order ID, dtype: int64

In [52]:
# Question 10: Count number of orders by city.
df.groupby('City')['Order ID'].nunique()

City
Aberdeen        1
Abilene         1
Akron          10
Albuquerque     7
Alexandria      6
               ..
Woonsocket      3
Yonkers         6
York            2
Yucaipa         1
Yuma            4
Name: Order ID, Length: 531, dtype: int64

In [62]:
# Question 11: Find the most common ship mode.
df['Ship Mode'].mode()[0]

'Standard Class'

In [65]:
# Question 12: Find the least common ship mode.
df['Ship Mode'].min()

'First Class'

In [69]:
# Question 13: Count number of orders shipped with "Same Day" mode.
df[df['Ship Mode']=='Same Day'].shape[0]

543

In [70]:
# Question 14: Count number of orders shipped with "First Class".
df[df['Ship Mode']=='First Class'].shape[0]

1538

In [72]:
# Question 15: Count number of orders shipped with "Second Class".
df[df['Ship Mode']== 'Second Class'].shape[0]

1945

In [73]:
# Question 16: Count number of orders shipped with "Standard Class".
df[df['Ship Mode']== 'Standard Class'].shape[0]

5968

In [77]:
# Question 17: Find number of orders in each year.
df['Year']=pd.to_datetime(df["Order Date"]).dt.year
df.groupby('Year')['Order ID'].nunique()

Year
2014     969
2015    1038
2016    1315
2017    1687
Name: Order ID, dtype: int64

In [79]:
# Question 18: Find number of orders in each quarter.
df['quarter']= df['Order Date'].dt.quarter
df.groupby('quarter')['Order ID'].nunique()

quarter
1     694
2    1076
3    1367
4    1872
Name: Order ID, dtype: int64

In [80]:
# Question 19: Find number of orders in each month.
df['month']= df['Order Date'].dt.month
df.groupby('month')['Order ID'].nunique()

month
1     178
2     162
3     354
4     343
5     369
6     364
7     338
8     341
9     688
10    417
11    753
12    702
Name: Order ID, dtype: int64

In [81]:
# Question 20: Find number of orders in each weekday.
df['weekday']= df['Order Date'].dt.weekday
df.groupby('weekday')['Order ID'].nunique()

weekday
0    920
1    558
2    182
3    746
4    916
5    837
6    850
Name: Order ID, dtype: int64

In [88]:
# Question 21: Count orders with discount applied.
df[df['Discount']>0].shape[0]

5196

In [90]:
# Question 22: Count orders without discount.
df[df['Discount'] == 0].shape[0]

4798

In [93]:
# Question 23: Count orders where discount = 0.
df[df['Discount'] == 0].shape[0]

4798

In [94]:
# Question 24: Count orders where discount > 0.2
df[df['Discount'] > 0.2].shape[0]

1393

In [96]:
# Question 25: Count orders where discount = 0.5.
df[df['Discount'] == 0.5].shape[0]

66

In [97]:
# Question 26: Find maximum discount given.
df['Discount'].max()

0.8

In [98]:
# Question 27: Find minimum discount given.
df['Discount'].min()

0.0

In [100]:
# Question 28: Count orders where profit < 0.
df[df['Profit'] < 0].shape[0]

1871

In [101]:
# Question 29: Count orders where profit = 0.
df[df['Profit'] == 0].shape[0]

65

In [102]:
# Question 30: Count orders where profit > 100.
df[df['Profit'] > 100].shape[0]

890

In [103]:
# Question 31: Count orders where sales > 1000.
df[df['Profit'] >1000].shape[0]

42

In [105]:
# Question 32: Find total quantity sold.
df['Quantity'].sum()

np.int64(37873)

In [106]:
# Question 33: Find average quantity per order.
df['Quantity'].mean()

np.float64(3.789573744246548)

In [107]:
# Question 34: Find average sales per order.
df['Sales'].mean()

np.float64(229.85800083049833)

In [108]:
# Question 35: Find average profit per order.
df['Profit'].mean()

np.float64(28.656896307784663)

In [110]:
# Question 36: Find maximum sales in a single order.
df['Sales'].max()

22638.48

In [111]:
# Question 37: Find minimum sales in a single order.
df['Sales'].min()

0.44399999999999995

In [112]:
# Question 38: Find maximum profit in a single order.
df['Profit'].max()

8399.975999999999

In [113]:
# Question 39: Find minimum profit in a single order.
df['Profit'].min()

-6599.978000000001

In [5]:
# Question 40: Find number of orders per customer.
df.groupby('Customer ID')['Order ID'].nunique()

Customer ID
AA-10315     5
AA-10375     9
AA-10480     4
AA-10645     6
AB-10015     3
            ..
XP-21865    11
YC-21895     5
YS-21880     8
ZC-21910    13
ZD-21925     5
Name: Order ID, Length: 793, dtype: int64

In [10]:
# Question 40: Find number of orders per customer.
df.groupby('Customer ID')['Order ID'].nunique()

Customer ID
AA-10315     5
AA-10375     9
AA-10480     4
AA-10645     6
AB-10015     3
            ..
XP-21865    11
YC-21895     5
YS-21880     8
ZC-21910    13
ZD-21925     5
Name: Order ID, Length: 793, dtype: int64

In [11]:
# Question 41: Find customers who placed only 1 order.
orders_per_customer = df.groupby('Customer ID')['Order ID'].nunique()
customers_one_order = orders_per_customer[orders_per_customer == 1]
print(customers_one_order)

Customer ID
AO-10810    1
AR-10570    1
CJ-11875    1
JC-15385    1
JR-15700    1
LD-16855    1
MG-18205    1
PH-18790    1
RE-19405    1
RM-19750    1
SM-20905    1
TC-21145    1
Name: Order ID, dtype: int64

In [12]:
# Question 42: Find customers who placed more than 10 orders.
orders_per_customer = df.groupby('Customer ID')['Order ID'].nunique()
customers_one_order = orders_per_customer[orders_per_customer > 10]
print(customers_one_order)

Customer ID
AH-10690    12
BD-11320    12
BF-11170    11
BM-11650    11
BP-11095    12
CC-12220    12
CK-12205    13
CK-12595    11
CL-12565    12
CS-11950    11
CS-12250    12
CS-12355    11
DK-12835    12
Dp-13240    11
EA-14035    13
EH-13765    12
EP-13915    17
GA-14725    11
GB-14530    11
GT-14710    11
HG-14965    12
JD-15895    11
JE-15745    13
JF-15490    11
JG-15160    11
JL-15835    11
KB-16585    12
KD-16495    12
KL-16645    12
LA-16780    11
LC-16885    12
MA-17560    11
MM-17920    11
MY-18295    11
NS-18640    13
PG-18820    13
PK-19075    12
PO-18850    11
RB-19465    12
RP-19390    12
SC-20725    11
SE-20110    11
SH-19975    13
SJ-20125    12
SM-20950    12
SZ-20035    11
WB-21850    11
XP-21865    11
ZC-21910    13
Name: Order ID, dtype: int64

In [15]:
# Question 43: Find total number of states represented.
df['State'].nunique()

49

In [17]:
# Question 44: Find total number of cities represented.
df['City'].nunique()

531

In [24]:
# Question 45: Find number of orders placed from California.
df[df['City']=='California'].shape[0]

0

In [22]:
# Question 46: Find number of orders placed from New York.
df[df['City']=='New York'].shape[0]

0

In [3]:
# Question 47: Find number of orders placed from Texas.
df[df['City']=='Texas'].shape[0]

0

In [4]:
# Question 48: Find number of orders placed from Florida.
df[df['City']=='Florida'].shape[0]

0

In [17]:
# Question 49: Find number of orders shipped after 5 days of order.
df['Order Date'] = pd.to_datetime(df['Order Date'])
df['Ship Date'] = pd.to_datetime(df['Ship Date'])
late_orders = df[(df['Ship Date'] - df['Order Date']).dt.days>5]
late_orders['Order ID'].nunique()

904

In [22]:
# Question 50: Find average shipping time in days.

df['Order Date'] = pd.to_datetime(df['Order Date'])
df['Ship Date'] = pd.to_datetime(df['Ship Date'])
avg_shipping = (df['Ship Date']-df['Order Date']).dt.days.mean()
avg_shipping

np.float64(3.958174904942966)

In [26]:
# Question 51: Find total sales.
df['Sales'].sum()

np.float64(2297200.8603000003)

In [27]:
# Question 52: Find total profit.
df['Profit'].sum()

np.float64(286397.0216999999)

In [32]:
# Question 53: Find average sales per order.
df['Sales'].sum()/df['Order ID'].nunique()

np.float64(458.61466566180883)

In [33]:
# Question 54: Find average profit per order.
df['Profit'].sum()/df['Order ID'].nunique()

np.float64(57.17648666400478)

In [36]:
# Question 55: Find sales by category.
df.groupby('Category')['Sales'].sum()

Category
Furniture          741999.7953
Office Supplies    719047.0320
Technology         836154.0330
Name: Sales, dtype: float64

In [37]:
# Question 56: Find profit by category.
df.groupby('Category')['Profit'].sum()

Category
Furniture           18451.2728
Office Supplies    122490.8008
Technology         145454.9481
Name: Profit, dtype: float64

In [39]:
# Question 57: Find sales by sub-category.
df.groupby('Sub-Category')['Sales'].sum()

Sub-Category
Accessories    167380.3180
Appliances     107532.1610
Art             27118.7920
Binders        203412.7330
Bookcases      114879.9963
Chairs         328449.1030
Copiers        149528.0300
Envelopes       16476.4020
Fasteners        3024.2800
Furnishings     91705.1640
Labels          12486.3120
Machines       189238.6310
Paper           78479.2060
Phones         330007.0540
Storage        223843.6080
Supplies        46673.5380
Tables         206965.5320
Name: Sales, dtype: float64

In [40]:
# Question 58: Find profit by sub-category.
df.groupby('Sub-Category')['Profit'].sum()

Sub-Category
Accessories    41936.6357
Appliances     18138.0054
Art             6527.7870
Binders        30221.7633
Bookcases      -3472.5560
Chairs         26590.1663
Copiers        55617.8249
Envelopes       6964.1767
Fasteners        949.5182
Furnishings    13059.1436
Labels          5546.2540
Machines        3384.7569
Paper          34053.5693
Phones         44515.7306
Storage        21278.8264
Supplies       -1189.0995
Tables        -17725.4811
Name: Profit, dtype: float64

In [46]:
# Question 59: Find highest sales category.
df.groupby('Category')['Sales'].sum().idxmax()

'Technology'

In [50]:
# Question 60: Find highest profit category.
df.groupby('Category')['Profit'].sum().idxmax()

'Technology'

In [51]:
# Question 61: Find lowest profit category.
df.groupby('Category')['Profit'].sum().idxmin()

'Furniture'

In [52]:
# Question 62: Find lowest sales sub-category.
df.groupby('Sub-Category')['Sales'].sum().idxmin()

'Fasteners'

In [53]:
# Question 63: Find highest profit sub-category.
df.groupby('Sub-Category')['Sales'].sum().idxmax()

'Phones'

In [54]:
# Question 64: Find lowest profit sub-category.
df.groupby('Sub-Category')['Sales'].sum().idxmin()

'Fasteners'

In [62]:
# Question 65: Find top 10 profitable products.
df.groupby('Product ID')['Profit'].sum().sort_values(ascending=False).head(10)
# df

Product ID
TEC-CO-10004722    25199.9280
OFF-BI-10003527     7753.0390
TEC-CO-10001449     6983.8836
TEC-CO-10003763     4570.9347
TEC-AC-10002049     4425.3432
TEC-MA-10001127     4094.9766
TEC-MA-10003979     3772.9461
TEC-MA-10001047     3717.9714
OFF-BI-10001120     3345.2823
TEC-MA-10000045     3343.5360
Name: Profit, dtype: float64

In [63]:
# Question 66: Find top 10 least profitable products.
df.groupby('Product ID')['Profit'].sum().sort_values(ascending=True).head(10)

Product ID
TEC-MA-10000418   -8879.9704
TEC-MA-10000822   -4589.9730
TEC-MA-10004125   -3839.9904
FUR-TA-10000198   -2876.1156
FUR-TA-10001889   -1934.3976
OFF-BI-10004995   -1878.1662
TEC-MA-10002412   -1811.0784
OFF-SU-10002881   -1299.1836
FUR-TA-10001950   -1201.0581
FUR-TA-10004289   -1148.4375
Name: Profit, dtype: float64

In [67]:
# Question 67: Find top 10 best-selling products by sales.
df.groupby('Product ID')['Sales'].sum().sort_values(ascending=True).tail(10)

Product ID
OFF-SU-10000151    17030.312
OFF-BI-10004995    17965.068
TEC-MA-10001127    18374.895
TEC-CO-10001449    18839.686
OFF-BI-10000545    19024.500
OFF-BI-10001359    19823.479
FUR-CH-10002024    21870.576
TEC-MA-10002412    22638.480
OFF-BI-10003527    27453.384
TEC-CO-10004722    61599.824
Name: Sales, dtype: float64

In [70]:
# Question 68: Find top 10 best-selling products by quantity.
df.groupby('Product ID')['Quantity'].sum().sort_values(ascending=False).head(10)

Product ID
TEC-AC-10003832    75
OFF-PA-10001970    70
OFF-BI-10001524    67
OFF-BI-10002026    64
FUR-CH-10002647    64
FUR-TA-10001095    61
TEC-AC-10002049    60
OFF-BI-10004728    59
FUR-CH-10003774    59
FUR-FU-10001473    57
Name: Quantity, dtype: int64

In [71]:
# Question 69: Find bottom 10 products by sales.
df.groupby('Product ID')['Quantity'].sum().sort_values(ascending=True).head(10)

Product ID
FUR-CH-10002317    1
OFF-AR-10002704    1
OFF-PA-10000048    1
FUR-BO-10002206    1
TEC-MA-10003493    1
OFF-AP-10002203    2
OFF-EN-10001535    2
TEC-AC-10003133    2
OFF-PA-10003739    2
TEC-MA-10002694    2
Name: Quantity, dtype: int64

In [88]:
# Question 70: Find bottom 10 products by profit.
df.groupby('Product ID')['Profit'].sum().sort_values(ascending=True).head(10)

Product ID
TEC-MA-10000418   -8879.9704
TEC-MA-10000822   -4589.9730
TEC-MA-10004125   -3839.9904
FUR-TA-10000198   -2876.1156
FUR-TA-10001889   -1934.3976
OFF-BI-10004995   -1878.1662
TEC-MA-10002412   -1811.0784
OFF-SU-10002881   -1299.1836
FUR-TA-10001950   -1201.0581
FUR-TA-10004289   -1148.4375
Name: Profit, dtype: float64

In [120]:
# Question 71: Find total sales by year.
df['Order Date']=pd.to_datetime(df['Order Date'])
df['Year']=df['Order Date'].dt.year
df.groupby('Year')['Sales'].sum()

Year
2014    484247.4981
2015    470532.5090
2016    609205.5980
2017    733215.2552
Name: Sales, dtype: float64

In [75]:
# Question 72: Find total profit by year.
df['Order Date']=pd.to_datetime(df['Order Date'])
df['Year']=df['Order Date'].dt.year
df.groupby('Year')['Profit'].sum()

Year
2014    49543.9741
2015    61618.6037
2016    81795.1743
2017    93439.2696
Name: Profit, dtype: float64

In [78]:
# Question 73: Find sales growth year by year.
df.groupby('Year')['Sales'].sum().pct_change()*100

Year
2014          NaN
2015    -2.832227
2016    29.471521
2017    20.355962
Name: Sales, dtype: float64

In [79]:
# Question 74: Find profit growth year by year.
df.groupby('Year')['Profit'].sum().pct_change()*100

Year
2014          NaN
2015    24.371540
2016    32.744284
2017    14.235675
Name: Profit, dtype: float64

In [84]:
# Question 75: Find sales by quarter.
df['quarter']=pd.to_datetime(df['Order Date']).dt.quarter
df.groupby('Year')['quarter'].sum()

Year
2014    5778
2015    6148
2016    7415
2017    9465
Name: quarter, dtype: int32

In [83]:
# Question 76: Find profit by quarter.
df['quarter']=pd.to_datetime(df['Order Date']).dt.quarter
df.groupby('quarter')['Profit'].sum()

quarter
1     48023.7440
2     55284.5395
3     72467.0785
4    110621.6597
Name: Profit, dtype: float64

In [89]:
# Question 77: Find sales by month.
df['month']=pd.to_datetime(df['Order Date']).dt.month
df.groupby('month')['Sales'].sum()

month
1      94924.8356
2      59751.2514
3     205005.4888
4     137762.1286
5     155028.8117
6     152718.6793
7     147238.0970
8     159044.0630
9     307649.9457
10    200322.9847
11    352461.0710
12    325293.5035
Name: Sales, dtype: float64

In [90]:
# Question 78: Find profit by month.
df.groupby('month')['Profit'].sum()

month
1      9134.4461
2     10294.6107
3     28594.6872
4     11587.4363
5     22411.3078
6     21285.7954
7     13832.6648
8     21776.9384
9     36857.4753
10    31784.0413
11    35468.4265
12    43369.1919
Name: Profit, dtype: float64

In [95]:
# Question 79: Find month with highest sales.
df.groupby('month')['Sales'].sum().sort_values(ascending=False).head(1)

month
11    352461.071
Name: Sales, dtype: float64

In [96]:
# Question 80: Find month with highest profit.
df.groupby('month')['Profit'].sum().sort_values(ascending=False).head(1)

month
12    43369.1919
Name: Profit, dtype: float64

In [98]:
# Question 81: Find month with lowest sales.
df.groupby('month')['Sales'].sum().sort_values(ascending=False).tail(1)

month
2    59751.2514
Name: Sales, dtype: float64

In [97]:
# Question 82: Find month with lowest profit.
df.groupby('month')['Profit'].sum().sort_values(ascending=False).tail(1)

month
1    9134.4461
Name: Profit, dtype: float64

In [100]:
# Question 83: Find total sales by weekday.
df['weekday']=pd.to_datetime(df['Order Date']).dt.weekday
df.groupby('weekday')['Sales'].sum()

weekday
0    428937.8157
1    287209.5022
2     88056.9752
3    321965.7785
4    427692.2593
5    357984.6830
6    385353.8464
Name: Sales, dtype: float64

In [101]:
# Question 84: Find total profit by weekday.
df.groupby('weekday')['Profit'].sum()

weekday
0    51511.1146
1    35570.3288
2    14703.8707
3    39683.7512
4    46520.8242
5    41277.6202
6    57129.5120
Name: Profit, dtype: float64

In [102]:
# Question 85: Find weekday with highest sales.
df.groupby('weekday')['Sales'].sum().sort_values(ascending=True).tail(1)

weekday
0    428937.8157
Name: Sales, dtype: float64

In [103]:
# Question 86: Find weekday with lowest sales.
df.groupby('weekday')['Sales'].sum().sort_values(ascending=True).head(1)

weekday
2    88056.9752
Name: Sales, dtype: float64

In [104]:
# Question 87: Find weekday with highest profit.
df.groupby('weekday')['Profit'].sum().sort_values(ascending=True).tail(1)

weekday
6    57129.512
Name: Profit, dtype: float64

In [105]:
# Question 88: Find weekday with lowest profit.
df.groupby('weekday')['Profit'].sum().sort_values(ascending=True).head(1)

weekday
2    14703.8707
Name: Profit, dtype: float64

In [107]:
# Question 89: Find state with highest sales.
df.groupby('State')['Sales'].sum().sort_values(ascending=True).tail(1)

State
California    457687.6315
Name: Sales, dtype: float64

In [108]:
# Question 90: Find state with highest profit.
df.groupby('State')['Profit'].sum().sort_values(ascending=True).tail(1)

State
California    76381.3871
Name: Profit, dtype: float64

In [110]:
# Question 91: Find state with lowest sales.
df.groupby('State')['Sales'].sum().sort_values(ascending=True).head(1)

State
North Dakota    919.91
Name: Sales, dtype: float64

In [109]:
# Question 92: Find state with lowest profit.
df.groupby('State')['Profit'].sum().sort_values(ascending=True).head(1)

State
Texas   -25729.3563
Name: Profit, dtype: float64

In [111]:
# Question 93: Find region with highest sales.
df.groupby('Region')['Sales'].sum().sort_values(ascending=True).tail(1)

Region
West    725457.8245
Name: Sales, dtype: float64

In [112]:
# Question 94: Find region with highest profit.
df.groupby('Region')['Profit'].sum().sort_values(ascending=True).tail(1)

Region
West    108418.4489
Name: Profit, dtype: float64

In [113]:
# Question 95: Find region with lowest sales.
df.groupby('Region')['Sales'].sum().sort_values(ascending=True).head(1)

Region
South    391721.905
Name: Sales, dtype: float64

In [114]:
# Question 96: Find region with lowest profit.
df.groupby('Region')['Profit'].sum().sort_values(ascending=True).head(1)

Region
Central    39706.3625
Name: Profit, dtype: float64

In [115]:
# Question 97: Find average discount overall.
df['Discount'].mean()

np.float64(0.15620272163297977)

In [116]:
# Question 98: Find average discount in each category.
df.groupby('Category')['Discount'].mean()

Category
Furniture          0.173923
Office Supplies    0.157285
Technology         0.132323
Name: Discount, dtype: float64

In [117]:
# Question 99: Find average discount in each sub-category.
df.groupby('Sub-Category')['Discount'].mean()

Sub-Category
Accessories    0.078452
Appliances     0.166524
Art            0.074874
Binders        0.372292
Bookcases      0.211140
Chairs         0.170178
Copiers        0.161765
Envelopes      0.080315
Fasteners      0.082028
Furnishings    0.138349
Labels         0.068681
Machines       0.306087
Paper          0.074891
Phones         0.154556
Storage        0.074704
Supplies       0.076842
Tables         0.261285
Name: Discount, dtype: float64

In [119]:
# Question 100: Compare total sales vs profit across regions.
df.groupby('Region')[['Sales','Profit']].sum()

               Sales       Profit
Region
Central  501239.8908   39706.3625
East     678781.2400   91522.7800
South    391721.9050   46749.4303
West     725457.8245  108418.4489

In [ ]:
# Question 101: Count customers in each region.

In [ ]:
# Question 102: Count customers in each state.

In [ ]:
# Question 103: Count customers in each city.

In [ ]:
# Question 104: Find total sales by customer.

In [ ]:
# Question 105: Find total profit by customer.

In [ ]:
# Question 106: Find average sales per customer.

In [ ]:
# Question 107: Find average profit per customer.

In [ ]:
# Question 108: Find customer with highest sales.

In [ ]:
# Question 109: Find customer with highest profit.

In [ ]:
# Question 110: Find customer with lowest sales.